Repository: share-extras/langpack-cy
Catalog: core/tmx/web-client.tmx
Source language: en_us
Languages: cy

source: To find a user search for them using their first name, last name and/or user name. Alternatively to see all users click 'Show All', however, this may take some time if there are a lot of users in the system.
cy: I canfod defnyddiwr chwiliwch amdanynt gan ddefnyddio ei enw cyntaf, enw olaf neu enw defnyddiwr. Neu, i weld pob defnyddiwr cliciwch Dangos Pob Un, ond gall hyn gymryd dipyn o amser os mae yna llawer of defnyddwyr yn y system.

source: Category
cy: Categori

source: Content Items
cy: Eitemau Cynnwys

source: Delete User
cy: Dileu Defnyddiwr

source: There are no workflows currently deployed in the repository, press Cancel to exit the wizard.
cy: Nid oes unrhyw llif gwaith wedi ei ddarparu yn y repositori. Cliciwch Diddymu i gau'r dewin.

source: Current Alfresco Repository
cy: Repositori Alfresco Presennol

source: Create Discussion
cy: Creu Trafodaeth

source: Manage multilingual properties of the document
cy: Rheoli priodweddau amlieithog y ddogfen

source: Available workflows
cy: Llifiau gwaith ar gael

source: Exports metadata and content from this or all Spaces.
cy: Allforio metadata a chynnwys o'r lle yma neu o bob lle.

source: Collapse All
cy: Chrebachu'r Cyfan

source: Select a script to execute
cy: Dewiswch sgript i weithredu

source: If any broken links are found you will receive a task in your to do list to fix them.
cy: Os fydd unrhyw cysylltiadau toredig yn cael eu canfod byddwch yn derbyn tasg yn eich rhestr 'I'w Gwneud' i'w drwsio.

source: Submitted
cy: Cyflwynwyd

source: No not now
cy: Na, dim rŵan

source: Clipboard
cy: Clipfwrdd

source: Choose this option to regenerate all renditions of content generated by a particular set of forms configured for the selected web project.
cy: Dewiswch y dewisiad yma i ail-gynhyrchu pob lluniad o gynnwys a gynhyrchwyd gan ffurflenni penodol yn y project gwe dewiswyd.

source: Is Subtype Condition
cy: Amod yn Is-Math

source: Click here to select a Web Project folder
cy: Cliciwch yma i ddewis ffolder Project Gwe

source: Undo All Items
cy: Dadwneud Pob Eitem

source: Step Three - Enter Details
cy: Cam Tri - Mewnbynnwch Manylion

source: Shared from {0}
cy: Wedi ei rhannu o {0}

source: Step two, view the summary of the new edition
cy: Cam dau, gweld crynodeb yr argraffiad newydd

source: Step One - Specify name and select type
cy: Cam Un - Dewiswch enw a math

source: Broken Links
cy: Cysylltiadau Toredig

source: Document Properties
cy: Priodweddau Dogfen

source: Step Two - Enter Content
cy: Cam Dau - Mewnbynnwch Cynnwys

source: Are you sure you want to delete all deployment reports across all sandboxes in this webproject?
cy: A ydych chi'n siŵr eich bod eisiau dileu pob adroddiad darpariaeth ar draws pob blwch tywod yn y project gwe yma?

source: Update a file in the website with content from your computer.
cy: Diweddaru ffeil yn y project gwe gyda chynnwys o'ch cyfrifiadur.

source: Edit multilingual properties when the dialog close
cy: Golygu priodweddau amlieithog pan fo'r deialog yn cau

source: Navigator
cy: Llywiwr

source: This document has no multilingual aspect.
cy: Nid oes agwedd amlieithog gan y ddogfen.

source: Create a layered folder in the website.
cy: Creu ffolder haenog yn y safle gwe.

source: Management
cy: Rheolaeth

source: WARNING: This folder is a special folder accessed by all Users! Please be sure that you wish to delete this folder. It may cause System Errors if you remove it.
cy: RHYBYDD: Mae'r ffolder hwn yn ffolder arbennig sy'n gyrchwir gan phob defnyddwyr! Gwnewch yn siŵr eich bod chi wir eisiau dileu'r ffolder yma, os gwelwch yn dda. Gall gwaredu achosi gwallau system.

source: Properties
cy: Priodweddau

source: Imports an Alfresco Content Package or ZIP format file into the repository.
cy: Mewnforio Pecyn Cynnwys Alfresco neu ffeil fformat ZIP i'r repositori.

source: This Space must be visible to the Guest user for the RSS feed to be publically viewable, you can Invite the Guest user using the
cy: Er mwyn gwneud y porthiant RSS yn cyhoeddus rhaid i'r lle yma bod yn gweledig i'r defnyddiwr Gwestai. Medrwch gwahoddi'r defnyddiwr Gwestai gan defnyddio'r golwg

source: Failed to update simple workflow due to system error: {0}
cy: Methwyd diweddaru'r llif gwaith syml oherwydd gwall system: {0}

source: Apply RSS Feed Template
cy: Gosod Templed Porthiant RSS

source: Please correct the errors below.
cy: Cywirwch y wallau isod, os gwelwch yn dda

source: Structure and contents
cy: Strwythur a chynnwys

source: Document name
cy: Enw dogfen

source: Notify Users
cy: Hysbysu Defnyddwyr

source: Forum Space
cy: Lle Fforwm

source: Run export in background
cy: Rhedeg allforiant yn y cefndir

source: Schema
cy: Sgema

source: Add Resource
cy: Ychwanegu Adnodd

source: Filter Contents
cy: Cynnwys Hidl

source: Translations
cy: Cyfieithiadau

source: Select the users and roles they will play in this space.
cy: Dewiswch y defnyddwyr a'u rolau yn y lle yma.

source: No items to display. To add an existing document click ''{0}'' action. To create an HTML or Plain Text file click ''{1}'' action.
cy: Dim eitemau i ddangos. I ychwanegu dogfen cyfredol cliciwch y gweithred "{0}". I greu ffeil HTML neu Destun Plaen cliciwch y gweithred "{1}".

source: Rendition mimetype
cy: Math MIME Lluniad

source: Use zz* to match any name that begins with zz; use *.txt to match any text file; use *zz* to match any file name that contains zz anywhere including the beginning or end.
cy: Defnyddiwch zz* i gydweddu â unrhyw enw yn dechrau gyda zz; defnyddiwch *.txt i gydweddu â unrhyw ffeil testun; defnyddiwch *zz* i gydweddu â unrhyw enw ffeil sy'n cynnwys zz yn rhywle, gan cynnwys y dechrau a'r diwedd.

source: Are you sure you want to release the test server allocated to this sandbox?
cy: A ydych chi'n siŵr eich bod eisiau rhyddhau'r gweinydd profi a neilltuwyd i'r blwch tywod yma?

source: My Images
cy: Fy Nelweddau

source: All
cy: Pob Un

source: Related Content
cy: Cynnwys Perthnasol

source: Edit Topic Details
cy: Golygu Manylion Pwnc

source: View In Browser
cy: Gweld mewn Porwr

source: Create a new empty Web Project
cy: Creu Project Gwe gwag newydd

source: Forum Space Details
cy: Manylion Lle Fforwm

source: Failed to create layered folder as the target path {0} does not exist in the web project selected.
cy: Methwyd creu ffolder haenog oherwydd nid yw'r llwybr targed yn bodoli yn y project gwe dewiswyd.

source: Due Date
cy: Dyddiad Disgwyliedig

source: Select and configure web forms for generating site content.
cy: Dewiswch a ffurfweddu ffurflenni gwe ar gyfer creu cynnwys y safle.

source: Specify Space
cy: Penodi Lle

source: General Properties
cy: Priodweddau Cyffredinol

source: If this option is selected the rule will execute in the background so the results may not appear immediately.
cy: Os ddewisir y dewisiad yma gweithreda'r rheol yma yn y cefndir ac ac efallai na fydd y ganlyniadau yn ymddangos ar unwaith.

source: Are you sure you want to delete "{0}" and all its contents?
cy: A ydych chi'n siŵr eich bod eisiau dileu "{0}" a'i holl cynnwys?

source: Task Done & Re-Submit All
cy: Tasg Wedi'i Wneud & Ail-Gyflwyno Pob Un

source: Enter information about the space.
cy: Mewnbynnwch gwybodaeth am y lle.

source: Link Properties
cy: Priodweddau Cyswllt

source: Old Password
cy: Hen Gyfrinair

source: Optionally select an existing project to be used as the template for this website
cy: Dewisol - dewiswch project cyfredol i ddefnyddio fel templed ar gyfer y safle gwe yma

source: Please correct the errors below then click Create Forum Space.
cy: Cywirwch y wallau isod a chliciwch Creu Lle Fforwm, os gwelwch yn dda.

source: Change Category
cy: Newid Categori

source: Workflow History
cy: Hanes Llif Gwaith

source: Undo Check Out for
cy: Dadwneud Gwiriad i Fewn

source: This dialog allows the completed task details to be viewed.
cy: Mae'r deialog yma yn caniatáu gweld manylion y tasg cyflawn.

source: Started
cy: Wedi Dechrau

source: About Alfresco
cy: Ynghylch Alfresco

source: Aspect
cy: Agwedd

source: Invite Users Wizard
cy: Dewin Gwahodd Defnyddwyr

source: Remove Feature Action
cy: Gweithred Tynnu Nodwedd

source: Categories
cy: Categorïau

source: Copy
cy: Copïo

source: Preview the content or space within a Template.
cy: Rhagolygu'r cynnwys neu'r lle mewn Templed.

source: This view shows you all the rules to be applied to content in this space.
cy: Mae'r golwg yma yn eich ddangos yr holl rheolau a fydd yn eu gymhwyso i gynnwys yn y lle yma.

source: Manage the members of a group, create new groups or remove existing groups.
cy: Rheoli aelodau grŵp, creu grwpiau newydd neu tynnu grwpiau cyfredol.

source: Date Deleted
cy: Dyddiad Dileu

source: Select the users and roles they will play for this content.
cy: Dewiswch y defnyddwyr a'i rolau ar gyfer y cynnwys yma.

source: Step two, edit the detail of the new edition
cy: Cam dau, golygu manylion yr argraffiad newydd

source: No Web Forms available
cy: Dim Ffurflenni Gwe ar gael

source: Create a new folder in the website.
cy: Creu ffolder newydd yn y safle gwe.

source: Default Webapp
cy: Cymhwysiad Gwe Rhagosodedig

source: This document does not yet have any categories applied.
cy: Nid oes gan y ddogfen unrhyw categori eto.

source: {0} file(s) were checked, {1} link(s) were found.
cy: {0} ffeil(iau) wedi eu gwirio, {1} cysylltiadau wedi eu canfod

source: Link Destination
cy: Cyrchfan Cyswllt

source: Enter information about the rendering engine templates you want to use for form {0}.
cy: Mewnbynnwch manylion y templedi peiriant llunio a ydych eisiau defnyddio gyda'r ffurflen "{0}".

source: Invite
cy: Gwahodd

source: Not
cy: Dim

source: Custom View
cy: Golwg Dewisol

source: Enter information about the new topic then click Create Topic.
cy: Mewnbynnwch gwybodaeth am y pwnc newydd a chliciwch Creu Pwnc.

source: Search results shown may not be up-to-date with changes made in your local sandbox.
cy: Mae'n bosib nid yw'r canlyniadau chwiliad a ddangosir yn mor diweddar â'r newidiadau yn eich blwch tywod lleol.

source: Consumer
cy: Darllenwr

source: Browse Folders
cy: Pori Ffolderau

source: There are no users or groups assigned to this space, press Cancel to exit the dialog.
cy: Nid oes unrhyw defnyddwyr neu grwpiau wedi eu neilltuo i'r lle yma, cliciwch Diddymu i gadael y deialog.

source: Select options for the workflow
cy: Dewis dewisiadau ar gyfer y llif gwaith

source: Import To
cy: Mewnforio I

source: The following items will be submitted
cy: Bydd yr eitemau dilynol yn cael eu gyflwyno

source: Delete Deployment Server
cy: Dileu Gweinydd Darpariaeth

source: Edit File
cy: Golygu Ffeil

source: Staging
cy: Llwyfo

source: Shelf
cy: Silff

source: Selected Rule Actions
cy: Gweithredoedd Rheol Dewiswyd

source: You may select a destination where you wish the recovered items to be placed. If you do not select a destination, the original location of the item is used. Recovery of an item may fail if the destination does not exist or you do not have permission to add items there.
cy: Gallwch chi ddewis cyrchfan lle fydd yr eitemau yn cael eu osod. Fydd y lleoliad gwreiddiol yn cael ei defnyddio os nad oes cyrchfan wedi ddewis. Gall adferiad eitem aflwyddo os nid yw'r cyrchfan yn bodoli neu oes na gennwch chi caniatâd i ychwanegu eitemau yna.

source: Copy existing space
cy: Copïo lle cyfredol

source: The following items were recovered successfully
cy: Mae'r eitemau dilynol wedi eu adfer yn llwyddiannus

source: Invite Content Users Wizard
cy: Dewin Gwahodd Defnyddwyr Cynnwys

source: Delete Layered Folder
cy: Dileu Ffolder Haenol

source: Versioned Document Details
cy: Manylion Dogfen Fersiynnol

source: To remove this category and all it's sub-categories, click Delete.
cy: I gwaredu'r categori yma a'i holl is-gategorïau, cliciwch Iawn.

source: Manage Multilingual Content for
cy: Rheoli Cynnwys Amlieithog am

source: Who
cy: Pwy

source: Edit Post
cy: Golygu Post

source: User - User Properties
cy: Defnyddiwr - Priodweddau Defnyddiwr

source: General Preferences
cy: Dewisiadau Cyffredinol

source: Edit multilingual content properties
cy: Golygu priodweddau cynnwys amlieithog

source: Take a tour of some of the key features in Alfresco.
cy: Cymerwch taith o rhai o'r nodweddion yn Alfresco.

source: Please correct the errors below then click Post.
cy: Cywirwch y wallau isod a chliciwch Postio, os gwelwch yn dda.

source: Create Content Wizard
cy: Dewin Creu Cynnwys

source: Check in changes and keep file checked out
cy: Gwirio i fewn newidiadau a chadw'r ffeil wedi ei gwirio allan

source: Deployment Report for {0}
cy: Adroddiad Darpariaeth ar gyfer {0}

source: Search for and select items.
cy: Chwilio am a dewis eitemau.

source: Filter
cy: Hidl

source: To undo the changes to the selected files in the sandbox, click OK.
cy: I ddadwneud pob newidiad i'r ffeiliau dewiswyd yn y blwch tywod, cliciwch Iawn.

source: Executes script ''{0}''
cy: Gweithredu'r sgript "{0}"

source: Maximum users exceeded - please try again later and/or contact your system administrator.
cy: Wedi mynd tu hwnt i'r uchafswm defnyddwyr - ceisiwch eto yn hwyrach neu gysylltwch â'ch gweinyddwr system.

source: The node''s content is missing: node: {0} reader: {1} Please contact your system administrator.
cy: Mae cynnwys y nôd ar goll: nôd: {0} darllenwr: {1} Cysylltwch â'ch gweinyddwr system, os gwelwch yn dda.

source: Licensed: {0} license granted to {1} and limited to {3} days expiring {4,date,short} ({5} days remaining - issued on {2,date,short}).
cy: Trwyddedu: Trwydded {0} wedi ei addef i {1} a wedi cyfyngu i {3} diwrnod yn darfod ar {4,date,short} ({5} diwrnod ar ôl - wedi ei dyroddi ar {2,date,short}).

source: Selected users/groups and their role(s)
cy: Defnyddwyr/Grwpiau a'u rol(au) dewiswyd

source: Failed
cy: Methwyd

source: {0} must be between {1} and {2} characters in length.
cy: Rhaid bod hyd {0} rhwng {1} a {2} nodau.

source: Regenerated all renditions generated by {0}.
cy: Wedi ail-gynhyrchu pob lluniad a gynhyrchwyd gan {0}.

source: Check In
cy: Gwirio i Fewn

source: Note: To change individual expiration dates click the 'Change Expiration Date' action icon.
cy: Nodyn: I newid dyddiadau darfod unigol cliciwch yr eicon gweithred 'Newid Dyddiad Darfod'.

source: If this option is selected the import will be performed in the background so the results may not appear immediately. You may also want to monitor the server console and log files for errors.
cy: Os ddewisir y ddewisiad yma bydd y mewnforyn yn cael ei berfformio yn y gefndir, ac efallai na fydd y ganlyniadau yn ymddangos ar unwaith. Efallai hoffech gwylio y consol gweinydd a'r ffeiliau cofnod am wallau.

source: Details
cy: Manylion

source: Step One - Starting Space
cy: Cam Un - Lle Dechrau

source: To create the rule click Finish. To review or change your selections click Back.
cy: I creu'r rheol cliciwch Gorffen. I adolygu neu i newid eich dewisiadau cliciwch Nôl.

source: More Deployment Reports
cy: Mwy o Adroddiadau Darpariaeth

source: Started on
cy: Wedi cychwyn ar

source: Select the destination server(s) to deploy to
cy: Dewiswch y gweinydd(ion) cyrchfan i ddarparu i

source: To remove this sandbox and the user from the Web Project, click OK.
cy: I waredu'r blwch tywod a'r defnyddiwr o'r Project Gwe, cliciwch Iawn.

source: Initiated by
cy: Wedi cychwyn gan

source: The following items cannot be submitted as they are already part of a workflow.
cy: Methu cyflwyno yr eitemau dilynol, oherwydd eu bod eisoes yn rhan o llif gwaith.

source: Raise an Issue
cy: Codi Mater

source: Unable to make this file multilingual.
cy: Methu gwneud y ffeil yn amlieithog.

source: Apply default workflow
cy: Rhoi'r llif gwaith rhagosodedig

source: To remove an invited user from this content, click Yes.
cy: I dynnu defnyddiwr gwahoddedig o'r cynnwys yma, cliciwch Ie.

source: Edit Categories
cy: Golygu Categorïau

source: Set expiration date for all modified items.
cy: Gosod dyddiad darfod ar gyfer pob eitem a newidiwyd.

source: This dialog helps you to add content to a space.
cy: Mae'r deialog yma yn eich cynorthwyo i ychwanegu cynnwys i lle.

source: Copy to ''{0}'' in ''{1}''
cy: Copïo i "{0}" tu fewn i "{1}"

source: Hide Details
cy: Cuddio Manylion

source: Create a new edition from this multilingual content.
cy: Creu argraffiad newydd o'r cynnwys amlieithog yma.

source: Username can only contain characters or digits.
cy: Dim ond llythrennau a rhifau gall yr Enw Defnyddiwr cynnwys

source: Are you sure you want to delete "{0}" and all its topics?
cy: A ydych chi'n siŵr eich bod eisiau dileu "{0}" a'i holl bynciau?

source: Group Properties
cy: Priodweddau Grŵp

source: Role
cy: Rôl

source: Allow Categorization
cy: Caniatáu Categoreiddio

source: Do you want to send an email to notify the invited users?
cy: A ydych eisiau anfon e-bost i hysbysu'r defnyddwyr gwahoddedig?

source: Confirm
cy: Cadarnhau

source: Create Shortcut
cy: Creu Llwybr Byr

source: To remove this post from the topic, click OK.
cy: I tynnu'r hysbysiad yma o'r pwnc, cliciwch Iawn.

source: Return to Pool
cy: Dychwelyd i'r Pwll

source: Browse Posts
cy: Pori Pyst

source: Search In
cy: Chwiliwch Mewn

source: Choose the workflow you want to start
cy: Dewiswch y llif gwaith hoffech chi creu

source: A traduction already exists for this locale.
cy: Mae cyfieithiad ar gyfer y lleoleiddiad yma yn bodoli eisoes.

source: Increases the size of the scrollable area by 100px
cy: Cynyddu'r maint yr ardal graddadwy gan 100 picseli

source: Person Properties
cy: Priodweddau Person

source: Space
cy: Lle

source: Enter the content of the message then click Post.
cy: Mewnbynnwch cynnwys y neges a chliciwch Postio.

source: Edit Document Properties
cy: Golygu Priodweddau Dogfen

source: Change
cy: Newid

source: Deploying...
cy: Darparu...

source: Author Web Content
cy: Awduro Cynnwys Gwe

source: To commit these changes to the web project, click Finish.
cy: I cyflwyno'r newidiadau yma i'r project gwe, cliciwch Gorffen.

source: Step Two - Space Options
cy: Cam Dau - Dewisiadau Lle

source: Parent folder missing
cy: Ffolder rhiant ar goll

source: No suitable workflows could be found for the modified items below
cy: Methu canfod llif gwaith addas i'r eitemau a newidiwyd isod

source: Save a search query for use again later
cy: Cadw ymholiad chwilio er mwyn ei ddefnyddio'n hwyrach

source: Sets property ''{0}''
cy: Gosod priodwedd "{0}"

source: Encoding
cy: Amgodiad

source: Edit User Details
cy: Golygu Manylion Defnyddiwr

source: Use this view to perform system administration functions.
cy: Defnyddiwch yr olwg yma i berfformio gorchwylion gweinyddiaeth.

source: Use the following workflow to submit all modified items
cy: Defnyddio'r llif gwaith dilynol i gyflwyno pob eitem a newidiwyd

source: Forum Space Properties
cy: Priodweddau Lle Fforwm

source: Task Type
cy: Math Tasg

source: Edit the working copy now
cy: Golygu'r copi gweithio rŵan

source: An error occurred in one of the dashlets.
cy: Digwyddodd gwall mewn un o'r dashlets.

source: Hints
cy: Awgrymau

source: Successfully reverted sandbox for user: {0}
cy: Dychwelwyd y blwch tywod ar gyfer y defnyddiwr {0} yn llwyddiannus

source: Select Web Form
cy: Dewis Ffurflen Gwe

source: Enter the information about the web project.
cy: Mewnbynnwch gwybodaeth am y project gwe.

source: Current User
cy: Defnyddiwr Presennol

source: Templates Selected
cy: Templedi Dewiswyd

source: Expand All
cy: Ehangu Pob Un

source: This dialog helps you to add content to a folder.
cy: Mae'r deialog yma yn eich cynorthwyo i ychwanegu cynnwys i ffolder.

source: Modify Forum Space Properties
cy: Newid Priodweddau Lle Fforwm

source: Use this view to change your password
cy: Defnyddiwch yr olwg yma i newid eich cyfrinair

source: Include Inherited Rules
cy: Cynnwys Rheoli Etifeddedig

source: Transform Action
cy: Gweithred Trawsffurfio

source: To remove this space and all of its contents, click OK.
cy: I gwaredu'r lle yma a'i holl cynnwys, cliciwch Iawn.

source: Undo Selected Items
cy: Dadwneud Eitemau Dewiswyd

source: Abort Submission
cy: Erthylu Cyflwyniad

source: Checked <span id='link-count'>0</span> links in <span id='file-count'>0</span> files.
cy: Wedi gwirio <span id='link-count'>0</span> cysylltiadau mewn <span id='file-count'>0</span> ffeiliau.

source: This document is not part of a simple workflow.
cy: Nid yw'r dogfen yma yn rhan o lif gwaith syml.

source: Configure deployment servers for the web project.
cy: Ffurfweddu gweinyddion darpariaeth ar gyfer y project gwe.

source: New edition details
cy: Manylion argraffiad newydd

source: Command (type help for help)
cy: Gorchymyn (teipiwch help am cymorth)

source: This document does not have any other properties to show.
cy: Nid oes gan y ddogfen unrhyw priodweddau arall i ddangos.

source: Step Two - Create From Existing Web Project
cy: Cam Dau - Creu o Broject Gwe Presennol

source: Reset All
cy: Ailosod Pob Un

source: Identifier
cy: Dynodiad

source: Step three, view the summary of the new edition
cy: Cam tri, gweld crynodeb yr argraffiad newydd

source: Multilingual Content Info
cy: Gwybodaeth Cynnwys Amlieithog

source: Multilingual Document Details
cy: Manylion Dogfen Amlieithog

source: This space has the following categories applied...
cy: Mae'r categorïau isod wedi eu cymhwyso i'r lle.

source: Failed to create Person due to error: {0}
cy: Methwyd creu Person oherwydd gwall: {0}

source: Save Modified Search
cy: Cadw Chwiliad a Newidiwyd

source: A template
cy: Templed

source: Message Recipients
cy: Derbynwyr Neges

source: Disable rule
cy: Analluogi rheol

source: This wizard helps you create a new form.
cy: Mae'r dewin yma yn eich cynorthwyo i greu ffurflen newydd.

source: Original Location
cy: Lleoliad Gwreiddiol

source: The item you are trying to delete can not be found, this may be because it has already been deleted. Please close this dialog and try the delete operation again.
cy: Ni ellir canfod yr eitem rydych chi'n ceisio dileu, efallai bod o wedi ei dileu yn barod. Caewch y deialog a cheisiwch y gweithrediad eto, os gwelwch yn dda.

source: Last Name
cy: Cyfenw

source: Web Project Details
cy: Manylion Project Gwe

source: To close this wizard and save the modified settings for your web project space click Finish. To review or change your selections click Back.
cy: I gau'r dewin a chadw eich gosodiadau a newidiwyd ar gyfer eich lle project gwe cliciwch Gorffen. I adolygu neu i newid eich dewisiadau cliciwch Nôl.

source: My Home
cy: Fy Nghartref

source: Paste As Link
cy: Gludo Linc

source: Hint: When you check out a file a copy is made for you to work with.
cy: Awgrym: Pan ydych yn gwirio allan ffeil fydd copi yn cael ei gwneud i chi weithio gyda.

source: Last 30 days
cy: Yr 30 diwrnod olaf

source: Successfully took ownership of the object.
cy: Cymerwyd perchenogaeth y gwrthrych yn llwyddiannus.

source: This is only recommended for HTML or plain text documents.
cy: Argymhellir ar gyfer dogfennau HTML neu destun plaen yn unig.

source: User ''{0}'' is the current owner of this space.
cy: Defnyddiwr "{0}" yw perchennog presennol y lle yma.

source: Invite Users
cy: Gwahodd Defnyddwyr

source: Action Settings
cy: Gosodiadau Gweithred

source: Common Multilingual Content Properties
cy: Priodweddau Cynnwys Amlieithog Cyffredin

source: Edit Space Details
cy: Golygu Manylion Lle

source: Last Deployment Report
cy: Adroddiad Darpariaeth Olaf

source: Results for ''{0}'' in ''{1}''.
cy: Canlyniadau ar gyfer "{0}" mewn "{1}".

source: Notify the website users.
cy: Hysbysu defnyddwyr y safle gwe

source: Start Discussion
cy: Cychwyn Trafodaeth

source: List of your tasks still to complete
cy: Rhestr o'ch tasgau ni chwblhawyd

source: Home Space
cy: Lle Cartref

source: Create Web Content
cy: Creu Cynnwys Gwe
